---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.LanguageWhenSaved
source: html/2ea1f11e-1535-89c1-52c5-ee729cbe9b6e.htm
---
# Autodesk.Revit.DB.BasicFileInfo.LanguageWhenSaved Property

Return the language active for the last save

## Syntax (C#)
```csharp
public LanguageType LanguageWhenSaved { get; }
```